Tekla.Structures.Drawing.DimensionSetBaseAttributes.Placings
The placing types of the objects.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.Placings.Free
The placing of the object is free.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.Placings.Fixed
The placing of the object is fixed.